{
  "announcements": [
    {
      "details": "Read the commentary on the readings for the 30th Sunday in Ordinary Time",
      "link": "/commentary/2025/10/25/commentary-30th-sunday-in-ordinary-time-year-c/",
      "linkText": "Read Now",
      "title": "Commentary: 30th Sunday in Ordinary Time"
    },
    {
      "details": "There will be ONE mass on Sunday, 26th October, 2025. Offertory will be led by the Tuesday borns and Christian Sons and Daughters Association. Prayer of the faithful will be led by the Lectors.",
      "title": "Mass Schedule: 30th Sunday in Ordinary Time"
    },
    {
      "details": "From Monday 20th to Wednesday 22nd, Rosary prayers will be led by the Sacred Heart of Jesus Confraternity. From Thursday 23rd to Saturday 25th Rosary prayers will be led by the St. Vincent De Paul Society.",
      "title": "Rosary Prayer Schedule: 20th - 25th October"
    },
    {
      "details": "Parents and guardians with wards in boarding and tertiary schools are encouraged to submit their details to members of the Formation Team or the Youth Council.",
      "title": "School Visitation Project"
    },
    {
      "details": "On Sunday, 26th October, there will be breast cancer screening after mass. We are all expected to include a touch of pink in our dressing.",
      "title": "St Bakhita Goes Pink: Breast Cancer Awareness Month"
    },
    {
      "details": "In an effort to foster stronger fellowship among the youth, the Parish Youth Council will be reaching out to members in the Youth WhatsApp group via phone calls in the following days. We encourage everyone to respond positively and help in building a united St. Bakhita community.",
      "title": "Bakhita Youth WhatsApp Outreach"
    },
    {
      "details": "The Deanery Rosary Climax is scheduled for Saturday, 25th October at 3pm. The procession starts at Datus School, Tema and ends at the St. Joseph the Worker Grotto.",
      "title": "Deanery Rosary Climax"
    },
    {
      "details": "St Bakhita children will be responsible for the crowning of Mary at the St Joseph the Worker grotto on Saturday 25th October. All parents who would like their children to participate should register their names with the Sunday School teachers.",
      "title": "Crowning of Mary at St Joseph the Worker"
    },
    {
      "details": "We are kindly reminded of October as a Rosary Month. All parishioners are encouraged to prepare and participate fully in this prayer season in the month of October.",
      "title": "Rosary Month"
    },
    {
      "details": "UCMAS lessons begin on 6th September. Kindly register your child for a training in concentration, self-confidence and all-round academic proficiency. Contact 0242146843 to register.",
      "title": "UCMAS Brain Development Programme"
    }
  ],
  "schedules": {
    "events": [
      {
        "details": "Date: 26th October, 2025. Time: 3pm.",
        "rate": "Free",
        "subtitle": "This year's Salve Regina is themed: Mary, Beacon of Hope. It will begin with Divine Mercy prayers.",
        "title": "Salve Regina"
      }
    ],
    "liturgicalWeek": "29th Week in Ordinary Time, 20th - 26th Oct",
    "masses": [
      {
        "details": "",
        "subtitle": "One Mass at 7:30am",
        "title": "30th Sunday in Ordinary Time"
      },
      {
        "details": "Rosary prayers begin 30 mins before mass",
        "subtitle": "Monday - Friday at 7pm.",
        "title": "Weekday Evening Mass"
      },
      {
        "details": "Rosary prayers begin 30 mins before mass",
        "subtitle": "Saturday at 6:30am",
        "title": "Saturday Morning Mass"
      }
    ],
    "sacraments": [
      {
        "details": "Kindly contact the church office to register for Infant Baptism",
        "subtitle": "First Saturday of every month, after Grotto Mass",
        "title": "Infant Baptism"
      },
      {
        "details": "",
        "subtitle": "The St Bakhita Marriage School will commence on the 19th of October, 2025.",
        "title": "Marriage School"
      },
      {
        "details": "",
        "subtitle": "Adults: Sunday after first mass; Children: Saturdays at 3pm",
        "title": "Catechism Classes"
      },
      {
        "details": "",
        "subtitle": "By appointment with the priest in charge.",
        "title": "Confession"
      }
    ]
  }
}