{
  "announcements": [
    {
      "details": "Read the commentary on the readings for the 28th Sunday in Ordinary Time",
      "link": "/commentary/2025/10/11/commentary-28th-sunday-in-ordinary-time-year-c/",
      "linkText": "Read Now",
      "title": "Commentary: 28th Sunday in Ordinary Time"
    },
    {
      "details": "There will be TWO masses on Sunday, 19th October, 2025. Offertory will be led by the St Vincent de Paul Society and the Monday borns respectively. Prayer of the faithful will be led by the Lectors.",
      "title": "Mass Schedule: 29th Sunday in Ordinary Time"
    },
    {
      "details": "From Monday 13th to Wednesday 15th, Rosary prayers will be led by the Knights and Ladies of Marshall. From Thursday 16th to Saturday 18th Rosary prayers will be led by the Christian Fathers Association",
      "title": "Rosary Prayer Schedule: 13th - 18th October"
    },
    {
      "details": "Parents and guardians with wards in boarding and tertiary schools are encouraged to submit their details to members of the Formation Team or the Youth Council.",
      "title": "School Visitation Project"
    },
    {
      "details": "There will be a talk next Sunday, October 19th on breast cancer. On Sunday, 26th October, there will also be breasts cancer screening on the day. We are all expected to include a touch of pink in our dressing.",
      "title": "St Bakhita Goes Pink: Breast Cancer Awareness Month"
    },
    {
      "details": "We are kindly reminded of October as a Rosary Month. All parishioners are encouraged to prepare and participate fully in this prayer season in the month of October.",
      "title": "Rosary Month"
    },
    {
      "details": "Forms for the St Bakhita marriage school are still available. Prospective counselees who wish to have their marriages solemnized in 2026 should pick up registration forms from the office of the parish priest. Counselees who have already picked forms are encouraged to submit them as soon as possible.",
      "title": "Marriage School"
    },
    {
      "details": "UCMAS lessons begin on 6th September. Kindly register your child for a training in concentration, self-confidence and all-round academic proficiency. Contact 0242146843 to register.",
      "title": "UCMAS Brain Development Programme"
    }
  ],
  "schedules": {
    "events": [
      {
        "details": "Date: 26th October, 2025. Time: 3pm.",
        "rate": "Free",
        "subtitle": "This year's Salve Regina is themed: Mary, Beacon of Hope. It will begin with Divine Mercy prayers.",
        "title": "Salve Regina"
      }
    ],
    "liturgicalWeek": "28th Week in Ordinary Time, 13th - 19th Oct",
    "masses": [
      {
        "details": "",
        "subtitle": "First Mass at 7:00am, Second Mass at 9:30am",
        "title": "29th Sunday in Ordinary Time"
      },
      {
        "details": "Rosary prayers begin 30 mins before mass",
        "subtitle": "Monday - Friday at 7pm.",
        "title": "Weekday Evening Mass"
      },
      {
        "details": "Rosary prayers begin 30 mins before mass",
        "subtitle": "Saturday at 6:30am",
        "title": "Saturday Morning Mass"
      }
    ],
    "sacraments": [
      {
        "details": "Kindly contact the church office to register for Infant Baptism",
        "subtitle": "First Saturday of every month, after Grotto Mass",
        "title": "Infant Baptism"
      },
      {
        "details": "",
        "subtitle": "The St Bakhita Marriage School will commence on the 19th of October, 2025.",
        "title": "Marriage School"
      },
      {
        "details": "",
        "subtitle": "Adults: Sunday after first mass; Children: Saturdays at 3pm",
        "title": "Catechism Classes"
      },
      {
        "details": "",
        "subtitle": "By appointment with the priest in charge.",
        "title": "Confession"
      }
    ]
  }
}