{
  "announcements": [
    {
      "details": "Read the commentary on the readings for the 30th Sunday in Ordinary Time",
      "link": "/commentary/2025/11/1/commentary-all-souls-day-year-c/",
      "linkText": "Read Now",
      "title": "Commentary: The Commemoration of All the Faithful Departed"
    },
    {
      "details": "There will be TWO masses on Sunday, 2nd November, 2025. Offertory will be led by the Sacred Heart of Jesus Confraternity and the Wednesday borns respectively. Prayer of the faithful will be led by the Lectors.",
      "title": "Mass Schedule: The Commemoration of All the Faithful Departed"
    },
    {
      "details": "Saturday, 1st November is the Solemnity of All Saints. Rosary prayers will be in the morning at 6:00am followed by Mass at 6:30am",
      "title": "Solemnity of All Saints"
    },
    {
      "details": "World Youth Day, Accra, is scheduled for 21st and 22nd November to take place at Kordiabe. All youth are encouraged to register at the finance desk or with either of the church secretaries.",
      "title": "World Youth Day, Accra"
    },
    {
      "details": "Parents and guardians with wards in boarding and tertiary schools are encouraged to submit their details to members of the Formation Team or the Youth Council.",
      "title": "School Visitation Project"
    },
    {
      "details": "In an effort to foster stronger fellowship among the youth, the Parish Youth Council will be reaching out to members in the Youth WhatsApp group via phone calls in the following days. We encourage everyone to respond positively and help in building a united St. Bakhita community.",
      "title": "Bakhita Youth WhatsApp Outreach"
    }
  ],
  "schedules": {
    "events": [
      {
        "details": "Date: 21st - 22nd November, 2025. Location: Kordiabe.",
        "rate": "Free",
        "subtitle": "All youth are encouraged to attend this year's event.",
        "title": "World Youth Day, Accra"
      }
    ],
    "liturgicalWeek": "30th Week in Ordinary Time, 27th Oct - 1st Nov",
    "masses": [
      {
        "details": "",
        "subtitle": "First mass at 7:00am, Second mass at 9:30am",
        "title": "The Commemoration of All the Faithful Departed"
      },
      {
        "details": "Rosary prayers begin 30 mins before mass",
        "subtitle": "Monday - Friday at 7pm.",
        "title": "Weekday Evening Mass"
      },
      {
        "details": "Rosary prayers begin 30 mins before mass",
        "subtitle": "Saturday at 6:30am",
        "title": "Saturday Morning Mass"
      }
    ],
    "sacraments": [
      {
        "details": "Kindly contact the church office to register for Infant Baptism",
        "subtitle": "First Saturday of every month, after Grotto Mass",
        "title": "Infant Baptism"
      },
      {
        "details": "",
        "subtitle": "The St Bakhita Marriage School will commence on the 19th of October, 2025.",
        "title": "Marriage School"
      },
      {
        "details": "",
        "subtitle": "Adults: Sunday after first mass; Children: Saturdays at 3pm",
        "title": "Catechism Classes"
      },
      {
        "details": "",
        "subtitle": "By appointment with the priest in charge.",
        "title": "Confession"
      }
    ]
  }
}